"AITA for telling my husband to stop asking our son for money, even though he regrets how we treated him in the past?\n\nOur son (24M) has always had a complicated relationship with us, but he’s very close to his aunts, my husband’s younger sisters. When he was a teenager, he got into serious trouble for bullying another kid at school. My husband and I didn’t know how to handle it, so we decided to punish him by not getting him anything for his 16th and 17th birthdays. We thought we were teaching him a lesson, but looking back, we realize it only drove him further away.\n\nAfter that, our son became more distant, and I still remember when he coldly told us we would regret how we treated him. We didn’t take him seriously at the time, but now it’s clear that his words weren’t just a teenage outburst.\n\nNow, at 24, our son is financially successful but has cut us off entirely. When my husband had a medical emergency recently, we were struggling with the bills and reached out to him for help. He flatly refused, telling us to \"fuck off.\" This crushed my husband, who deeply regrets the way we handled things back then and wishes he could go back and make it right.\n\nOur son has a peculiar tendency to spoil all the women he considers family. He made amends with the girl he bullied in high school, and they’re now good friends. He also lavishes attention and financial support on my husband’s younger sisters—his aunts. They told us that he said he doesn’t care who they help, even if it’s us, but despite this, they’re still hesitant to get involved. They’ve only helped us out a couple of times and are clearly reluctant to do more, likely because they don’t want to jeopardize their close relationship with him.\n\nMy husband is heartbroken. He’s trying to reconnect with our son, but every time he reaches out for help or to mend things, he’s met with anger or silence. I finally told my husband to stop asking our son for money. I feel like every time we ask, we push him further away, and I’m terrified that we’ll never have a chance to repair our relationship if we keep this up.\n\nMy husband is upset with me now, feeling like I’m giving up on our son. He’s filled with regret and sadness over how things have turned out, but I just don’t know what else to do. AITA"